RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_cam_regs.h
/*
 * RF_OR_INTEN (RW)
 *
 * RxFIFO Overrun Interrupt Enable. This bit enables the RX FIFO overrun interrupt.
 * 0 RxFIFO overrun interrupt is disabled
 * 1 RxFIFO overrun interrupt is enabled
 */
#define CAM_INT_EN_RF_OR_INTEN_MASK (0x40U)
#define CAM_INT_EN_RF_OR_INTEN_SHIFT (6U)
#define CAM_INT_EN_RF_OR_INTEN_SET(x) (((uint32_t)(x) << CAM_INT_EN_RF_OR_INTEN_SHIFT) & CAM_INT_EN_RF_OR_INTEN_MASK)
#define CAM_INT_EN_RF_OR_INTEN_GET(x) (((uint32_t)(x) & CAM_INT_EN_RF_OR_INTEN_MASK) >> CAM_INT_EN_RF_OR_INTEN_SHIFT)

/*
 * FB2_DMA_DONE_INTEN (RW)
 *
 * Frame Buffer2 DMA Transfer Done Interrupt Enable. This bit enables the interrupt of Frame Buffer2 DMA
 * transfer done.
 * 0 Frame Buffer2 DMA Transfer Done interrupt disable
 * 1 Frame Buffer2 DMA Transfer Done interrupt enable
 */
#define CAM_INT_EN_FB2_DMA_DONE_INTEN_MASK (0x8U)
#define CAM_INT_EN_FB2_DMA_DONE_INTEN_SHIFT (3U)
#define CAM_INT_EN_FB2_DMA_DONE_INTEN_SET(x) (((uint32_t)(x) << CAM_INT_EN_FB2_DMA_DONE_INTEN_SHIFT) & CAM_INT_EN_FB2_DMA_DONE_INTEN_MASK)
#define CAM_INT_EN_FB2_DMA_DONE_INTEN_GET(x) (((uint32_t)(x) & CAM_INT_EN_FB2_DMA_DONE_INTEN_MASK) >> CAM_INT_EN_FB2_DMA_DONE_INTEN_SHIFT)

/*
 * FB1_DMA_DONE_INTEN (RW)
 *
 * Frame Buffer1 DMA Transfer Done Interrupt Enable. This bit enables the interrupt of Frame Buffer1 DMA
 * transfer done.
 * 0 Frame Buffer1 DMA Transfer Done interrupt disable
 * 1 Frame Buffer1 DMA Transfer Done interrupt enable
 */
#define CAM_INT_EN_FB1_DMA_DONE_INTEN_MASK (0x4U)
#define CAM_INT_EN_FB1_DMA_DONE_INTEN_SHIFT (2U)
#define CAM_INT_EN_FB1_DMA_DONE_INTEN_SET(x) (((uint32_t)(x) << CAM_INT_EN_FB1_DMA_DONE_INTEN_SHIFT) & CAM_INT_EN_FB1_DMA_DONE_INTEN_MASK)
#define CAM_INT_EN_FB1_DMA_DONE_INTEN_GET(x) (((uint32_t)(x) & CAM_INT_EN_FB1_DMA_DONE_INTEN_MASK) >> CAM_INT_EN_FB1_DMA_DONE_INTEN_SHIFT)

/*
 * SOF_INT_EN (RW)
 *
 * Start Of Frame (SOF) Interrupt Enable. This bit enables the SOF interrupt.
 * 0 SOF interrupt disable
 * 1 SOF interrupt enable
 */
#define CAM_INT_EN_SOF_INT_EN_MASK (0x1U)
#define CAM_INT_EN_SOF_INT_EN_SHIFT (0U)
#define CAM_INT_EN_SOF_INT_EN_SET(x) (((uint32_t)(x) << CAM_INT_EN_SOF_INT_EN_SHIFT) & CAM_INT_EN_SOF_INT_EN_MASK)
#define CAM_INT_EN_SOF_INT_EN_GET(x) (((uint32_t)(x) & CAM_INT_EN_SOF_INT_EN_MASK) >> CAM_INT_EN_SOF_INT_EN_SHIFT)

/* Bitfield definition for register: CR2 */
/*
 * FRMCNT_15_0 (RO)
 *
 * Frame Counter. This is a 16-bit Frame Counter
 * (Wraps around automatically after reaching the maximum)
 */
#define CAM_CR2_FRMCNT_15_0_MASK (0xFFFF0000UL)
#define CAM_CR2_FRMCNT_15_0_SHIFT (16U)
#define CAM_CR2_FRMCNT_15_0_GET(x) (((uint32_t)(x) & CAM_CR2_FRMCNT_15_0_MASK) >> CAM_CR2_FRMCNT_15_0_SHIFT)

/*
 * FRMCNT_RST (RW)
 *
 * Frame Count Reset. Resets the Frame Counter.
 * 0 Do not reset
 * 1 Reset frame counter immediately
 */
#define CAM_CR2_FRMCNT_RST_MASK (0x8000U)
#define CAM_CR2_FRMCNT_RST_SHIFT (15U)
#define CAM_CR2_FRMCNT_RST_SET(x) (((uint32_t)(x) << CAM_CR2_FRMCNT_RST_SHIFT) & CAM_CR2_FRMCNT_RST_MASK)
#define CAM_CR2_FRMCNT_RST_GET(x) (((uint32_t)(x) & CAM_CR2_FRMCNT_RST_MASK) >> CAM_CR2_FRMCNT_RST_SHIFT)

/*
 * RXFF_LEVEL (RW)
 *
 * RxFIFO Full Level. When the number of data in RxFIFO reaches this level, a RxFIFO full interrupt is generated, or an RXFIFO DMA request is sent.
 * 000 4 Double words
 * 001 8 Double words
 * 010 16 Double words
 * 011 24 Double words
 * 100 32 Double words
 * 101 48 Double words
 * 110 64 Double words
 * 111 96 Double words
 */
#define CAM_CR2_RXFF_LEVEL_MASK (0xE00U)
#define CAM_CR2_RXFF_LEVEL_SHIFT (9U)
#define CAM_CR2_RXFF_LEVEL_SET(x) (((uint32_t)(x) << CAM_CR2_RXFF_LEVEL_SHIFT) & CAM_CR2_RXFF_LEVEL_MASK)
#define CAM_CR2_RXFF_LEVEL_GET(x) (((uint32_t)(x) & CAM_CR2_RXFF_LEVEL_MASK) >> CAM_CR2_RXFF_LEVEL_SHIFT)

/*
 * DMA_REQ_EN_RFF (RW)
 *
 * DMA Request Enable for RxFIFO. This bit enables the dma request from RxFIFO to the embedded DMA controller.
 * 0 Disable the dma request
 * 1 Enable the dma request. The UV Rx FIFO is only enabled to filling data in 2 plane mode.
 */
#define CAM_CR2_DMA_REQ_EN_RFF_MASK (0x20U)
#define CAM_CR2_DMA_REQ_EN_RFF_SHIFT (5U)
#define CAM_CR2_DMA_REQ_EN_RFF_SET(x) (((uint32_t)(x) << CAM_CR2_DMA_REQ_EN_RFF_SHIFT) & CAM_CR2_DMA_REQ_EN_RFF_MASK)
#define CAM_CR2_DMA_REQ_EN_RFF_GET(x) (((uint32_t)(x) & CAM_CR2_DMA_REQ_EN_RFF_MASK) >> CAM_CR2_DMA_REQ_EN_RFF_SHIFT)

/*
 * CLRBITFORMAT (RW)
 *
 * Input Byte & bit sequence same as OV5640, except for Raw mode. Used only for internal ARGB conversion.
 */
#define CAM_CR2_CLRBITFORMAT_MASK (0xFU)
#define CAM_CR2_CLRBITFORMAT_SHIFT (0U)
#define CAM_CR2_CLRBITFORMAT_SET(x) (((uint32_t)(x) << CAM_CR2_CLRBITFORMAT_SHIFT) & CAM_CR2_CLRBITFORMAT_MASK)
#define CAM_CR2_CLRBITFORMAT_GET(x) (((uint32_t)(x) & CAM_CR2_CLRBITFORMAT_MASK) >> CAM_CR2_CLRBITFORMAT_SHIFT)

/* Bitfield definition for register: STA */
/*
 * ERR_CL_BWID_CFG (W1C)
 *
 * The unsupported color (color_formats[3:0]) and bitwidth (sensor_bit_width[2:0]) configuation found
 */
#define CAM_STA_ERR_CL_BWID_CFG_MASK (0x80000UL)
#define CAM_STA_ERR_CL_BWID_CFG_SHIFT (19U)
#define CAM_STA_ERR_CL_BWID_CFG_SET(x) (((uint32_t)(x) << CAM_STA_ERR_CL_BWID_CFG_SHIFT) & CAM_STA_ERR_CL_BWID_CFG_MASK)
#define CAM_STA_ERR_CL_BWID_CFG_GET(x) (((uint32_t)(x) & CAM_STA_ERR_CL_BWID_CFG_MASK) >> CAM_STA_ERR_CL_BWID_CFG_SHIFT)

/*
 * HIST_DONE (W1C)
 *
 * hist cal done
 */
#define CAM_STA_HIST_DONE_MASK (0x40000UL)
#define CAM_STA_HIST_DONE_SHIFT (18U)
#define CAM_STA_HIST_DONE_SET(x) (((uint32_t)(x) << CAM_STA_HIST_DONE_SHIFT) & CAM_STA_HIST_DONE_MASK)
#define CAM_STA_HIST_DONE_GET(x) (((uint32_t)(x) & CAM_STA_HIST_DONE_MASK) >> CAM_STA_HIST_DONE_SHIFT)

/*
 * RF_OR_INT (W1C)
 *
 * RxFIFO Overrun Interrupt Status. Indicates the overflow status of the RxFIFO register. (Cleared by writing
 * 1)
 * 0 RXFIFO has not overflowed.
 * 1 RXFIFO has overflowed.
 */
#define CAM_STA_RF_OR_INT_MASK (0x2000U)
#define CAM_STA_RF_OR_INT_SHIFT (13U)
#define CAM_STA_RF_OR_INT_SET(x) (((uint32_t)(x) << CAM_STA_RF_OR_INT_SHIFT) & CAM_STA_RF_OR_INT_MASK)
#define CAM_STA_RF_OR_INT_GET(x) (((uint32_t)(x) & CAM_STA_RF_OR_INT_MASK) >> CAM_STA_RF_OR_INT_SHIFT)

