RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_cam_regs.h
/*
 * DMA_TSF_DONE_FB2 (W1C)
 *
 * DMA Transfer Done in Frame Buffer2. Indicates that the DMA transfer from RxFIFO to Frame Buffer2 is completed. It can trigger an interrupt if the corresponding enable bit is set in CAM_CR1. This bit can be cleared by by writing 1 or reflashing the RxFIFO dma controller in CAM_CR3. (Cleared by writing 1)
 * 0 DMA transfer is not completed.
 * 1 DMA transfer is completed.
 */
#define CAM_STA_DMA_TSF_DONE_FB2_MASK (0x400U)
#define CAM_STA_DMA_TSF_DONE_FB2_SHIFT (10U)
#define CAM_STA_DMA_TSF_DONE_FB2_SET(x) (((uint32_t)(x) << CAM_STA_DMA_TSF_DONE_FB2_SHIFT) & CAM_STA_DMA_TSF_DONE_FB2_MASK)
#define CAM_STA_DMA_TSF_DONE_FB2_GET(x) (((uint32_t)(x) & CAM_STA_DMA_TSF_DONE_FB2_MASK) >> CAM_STA_DMA_TSF_DONE_FB2_SHIFT)

/*
 * DMA_TSF_DONE_FB1 (W1C)
 *
 * DMA Transfer Done in Frame Buffer1. Indicates that the DMA transfer from RxFIFO to Frame Buffer1 is completed. It can trigger an interrupt if the corresponding enable bit is set in CAM_CR1. This bit can be cleared by by writing 1 or reflashing the RxFIFO dma controller in CAM_CR3. (Cleared by writing 1)
 * 0 DMA transfer is not completed.
 * 1 DMA transfer is completed.
 */
#define CAM_STA_DMA_TSF_DONE_FB1_MASK (0x200U)
#define CAM_STA_DMA_TSF_DONE_FB1_SHIFT (9U)
#define CAM_STA_DMA_TSF_DONE_FB1_SET(x) (((uint32_t)(x) << CAM_STA_DMA_TSF_DONE_FB1_SHIFT) & CAM_STA_DMA_TSF_DONE_FB1_MASK)
#define CAM_STA_DMA_TSF_DONE_FB1_GET(x) (((uint32_t)(x) & CAM_STA_DMA_TSF_DONE_FB1_MASK) >> CAM_STA_DMA_TSF_DONE_FB1_SHIFT)

/*
 * EOF_INT (W1C)
 *
 * End of Frame (EOF) Interrupt Status. Indicates when EOF is detected. (Cleared by writing 1)
 * 0 EOF is not detected.
 * 1 EOF is detected.
 */
#define CAM_STA_EOF_INT_MASK (0x80U)
#define CAM_STA_EOF_INT_SHIFT (7U)
#define CAM_STA_EOF_INT_SET(x) (((uint32_t)(x) << CAM_STA_EOF_INT_SHIFT) & CAM_STA_EOF_INT_MASK)
#define CAM_STA_EOF_INT_GET(x) (((uint32_t)(x) & CAM_STA_EOF_INT_MASK) >> CAM_STA_EOF_INT_SHIFT)

/*
 * SOF_INT (W1C)
 *
 * Start of Frame Interrupt Status. Indicates when SOF is detected. (Cleared by writing 1)
 * 0 SOF is not detected.
 * 1 SOF is detected.
 */
#define CAM_STA_SOF_INT_MASK (0x40U)
#define CAM_STA_SOF_INT_SHIFT (6U)
#define CAM_STA_SOF_INT_SET(x) (((uint32_t)(x) << CAM_STA_SOF_INT_SHIFT) & CAM_STA_SOF_INT_MASK)
#define CAM_STA_SOF_INT_GET(x) (((uint32_t)(x) & CAM_STA_SOF_INT_MASK) >> CAM_STA_SOF_INT_SHIFT)

/*
 * HRESP_ERR_INT (W1C)
 *
 * Hresponse Error Interrupt Status. Indicates that a hresponse error has been detected. (Cleared by writing
 * 1)
 * 0 No hresponse error.
 * 1 Hresponse error is detected.
 */
#define CAM_STA_HRESP_ERR_INT_MASK (0x4U)
#define CAM_STA_HRESP_ERR_INT_SHIFT (2U)
#define CAM_STA_HRESP_ERR_INT_SET(x) (((uint32_t)(x) << CAM_STA_HRESP_ERR_INT_SHIFT) & CAM_STA_HRESP_ERR_INT_MASK)
#define CAM_STA_HRESP_ERR_INT_GET(x) (((uint32_t)(x) & CAM_STA_HRESP_ERR_INT_MASK) >> CAM_STA_HRESP_ERR_INT_SHIFT)

/* Bitfield definition for register: DMASA_FB1 */
/*
 * PTR (RW)
 *
 * DMA Start Address in Frame Buffer1. Indicates the start address to write data. The embedded DMA controller will read data from RxFIFO and write it from this address through AHB bus. The address should be double words aligned.
 * In Two-Plane Mode, Y buffer1
 */
#define CAM_DMASA_FB1_PTR_MASK (0xFFFFFFFCUL)
#define CAM_DMASA_FB1_PTR_SHIFT (2U)
#define CAM_DMASA_FB1_PTR_SET(x) (((uint32_t)(x) << CAM_DMASA_FB1_PTR_SHIFT) & CAM_DMASA_FB1_PTR_MASK)
#define CAM_DMASA_FB1_PTR_GET(x) (((uint32_t)(x) & CAM_DMASA_FB1_PTR_MASK) >> CAM_DMASA_FB1_PTR_SHIFT)

/* Bitfield definition for register: DMASA_FB2 */
/*
 * PTR (RW)
 *
 * DMA Start Address in Frame Buffer2. Indicates the start address to write data. The embedded DMA controller will read data from RxFIFO and write it from this address through AHB bus. The address should be double words aligned.
 * In Two-Plane Mode, Y buffer2
 */
#define CAM_DMASA_FB2_PTR_MASK (0xFFFFFFFCUL)
#define CAM_DMASA_FB2_PTR_SHIFT (2U)
#define CAM_DMASA_FB2_PTR_SET(x) (((uint32_t)(x) << CAM_DMASA_FB2_PTR_SHIFT) & CAM_DMASA_FB2_PTR_MASK)
#define CAM_DMASA_FB2_PTR_GET(x) (((uint32_t)(x) & CAM_DMASA_FB2_PTR_MASK) >> CAM_DMASA_FB2_PTR_SHIFT)

/* Bitfield definition for register: BUF_PARA */
/*
 * LINEBSP_STRIDE (RW)
 *
 * Line Blank Space Stride. Indicates the space between the end of line image storage and the start of a new line storage in the frame buffer.
 * The width of the line storage in frame buffer(in double words) minus the width of the image(in double words) is the stride. The stride should be double words aligned. The embedded DMA controller will skip the stride before starting to write the next row of the image.
 */
#define CAM_BUF_PARA_LINEBSP_STRIDE_MASK (0xFFFFU)
#define CAM_BUF_PARA_LINEBSP_STRIDE_SHIFT (0U)
#define CAM_BUF_PARA_LINEBSP_STRIDE_SET(x) (((uint32_t)(x) << CAM_BUF_PARA_LINEBSP_STRIDE_SHIFT) & CAM_BUF_PARA_LINEBSP_STRIDE_MASK)
#define CAM_BUF_PARA_LINEBSP_STRIDE_GET(x) (((uint32_t)(x) & CAM_BUF_PARA_LINEBSP_STRIDE_MASK) >> CAM_BUF_PARA_LINEBSP_STRIDE_SHIFT)

/* Bitfield definition for register: IDEAL_WN_SIZE */
/*
 * HEIGHT (RW)
 *
 * Image Height. Indicates how many active pixels in a column of the image from the sensor.
 */
#define CAM_IDEAL_WN_SIZE_HEIGHT_MASK (0xFFFF0000UL)
#define CAM_IDEAL_WN_SIZE_HEIGHT_SHIFT (16U)
#define CAM_IDEAL_WN_SIZE_HEIGHT_SET(x) (((uint32_t)(x) << CAM_IDEAL_WN_SIZE_HEIGHT_SHIFT) & CAM_IDEAL_WN_SIZE_HEIGHT_MASK)
#define CAM_IDEAL_WN_SIZE_HEIGHT_GET(x) (((uint32_t)(x) & CAM_IDEAL_WN_SIZE_HEIGHT_MASK) >> CAM_IDEAL_WN_SIZE_HEIGHT_SHIFT)

/*
 * WIDTH (RW)
 *
 * Image Width. Indicates how many active pixels in a line of the image from the sensor.
 * The number of bytes to be transferred is re-calculated automatically in hardware based on cr1[color_ext] and cr1[store_mode]. Default value is 2*pixel number.
 * As the input data from the sensor is 8-bit/pixel format, the IMAGE_WIDTH should be a multiple of 8 pixels.
 */
#define CAM_IDEAL_WN_SIZE_WIDTH_MASK (0xFFFFU)
#define CAM_IDEAL_WN_SIZE_WIDTH_SHIFT (0U)
#define CAM_IDEAL_WN_SIZE_WIDTH_SET(x) (((uint32_t)(x) << CAM_IDEAL_WN_SIZE_WIDTH_SHIFT) & CAM_IDEAL_WN_SIZE_WIDTH_MASK)
#define CAM_IDEAL_WN_SIZE_WIDTH_GET(x) (((uint32_t)(x) & CAM_IDEAL_WN_SIZE_WIDTH_MASK) >> CAM_IDEAL_WN_SIZE_WIDTH_SHIFT)

/* Bitfield definition for register: CR18 */
/*
 * CAM_ENABLE (RW)
 *
 * CAM global enable signal. Only when this bit is 1, CAM can start to receive the data and store to memory.
 */
#define CAM_CR18_CAM_ENABLE_MASK (0x80000000UL)
#define CAM_CR18_CAM_ENABLE_SHIFT (31U)
#define CAM_CR18_CAM_ENABLE_SET(x) (((uint32_t)(x) << CAM_CR18_CAM_ENABLE_SHIFT) & CAM_CR18_CAM_ENABLE_MASK)
#define CAM_CR18_CAM_ENABLE_GET(x) (((uint32_t)(x) & CAM_CR18_CAM_ENABLE_MASK) >> CAM_CR18_CAM_ENABLE_SHIFT)

