RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_cam_regs.h
/*
 * C3 (RW)
 *
 * Two's compliment Green U/Cb multiplier coefficient. YUV=0x79C (-0.394) YCbCr=0x79C (-0.392).
 */
#define CAM_CSC_COEF2_C3_MASK (0x7FFU)
#define CAM_CSC_COEF2_C3_SHIFT (0U)
#define CAM_CSC_COEF2_C3_SET(x) (((uint32_t)(x) << CAM_CSC_COEF2_C3_SHIFT) & CAM_CSC_COEF2_C3_MASK)
#define CAM_CSC_COEF2_C3_GET(x) (((uint32_t)(x) & CAM_CSC_COEF2_C3_MASK) >> CAM_CSC_COEF2_C3_SHIFT)

/* Bitfield definition for register: CLRKEY_LOW */
/*
 * LIMIT (RW)
 *
 * Low range of color key applied to PS buffer. To disable PS colorkeying, set the low colorkey to 0xFFFFFF and the high colorkey to 0x000000.
 */
#define CAM_CLRKEY_LOW_LIMIT_MASK (0xFFFFFFUL)
#define CAM_CLRKEY_LOW_LIMIT_SHIFT (0U)
#define CAM_CLRKEY_LOW_LIMIT_SET(x) (((uint32_t)(x) << CAM_CLRKEY_LOW_LIMIT_SHIFT) & CAM_CLRKEY_LOW_LIMIT_MASK)
#define CAM_CLRKEY_LOW_LIMIT_GET(x) (((uint32_t)(x) & CAM_CLRKEY_LOW_LIMIT_MASK) >> CAM_CLRKEY_LOW_LIMIT_SHIFT)

/* Bitfield definition for register: CLRKEY_HIGH */
/*
 * LIMIT (RW)
 *
 * Low range of color key applied to PS buffer. To disable PS colorkeying, set the low colorkey to 0xFFFFFF and the high colorkey to 0x000000.
 */
#define CAM_CLRKEY_HIGH_LIMIT_MASK (0xFFFFFFUL)
#define CAM_CLRKEY_HIGH_LIMIT_SHIFT (0U)
#define CAM_CLRKEY_HIGH_LIMIT_SET(x) (((uint32_t)(x) << CAM_CLRKEY_HIGH_LIMIT_SHIFT) & CAM_CLRKEY_HIGH_LIMIT_MASK)
#define CAM_CLRKEY_HIGH_LIMIT_GET(x) (((uint32_t)(x) & CAM_CLRKEY_HIGH_LIMIT_MASK) >> CAM_CLRKEY_HIGH_LIMIT_SHIFT)

/* Bitfield definition for register array: HISTOGRAM_FIFO */
/*
 * HIST_Y (RO)
 *
 * the appearance of bin x (x=(address-DATA0)/4)
 */
#define CAM_HISTOGRAM_FIFO_HIST_Y_MASK (0xFFFFFFUL)
#define CAM_HISTOGRAM_FIFO_HIST_Y_SHIFT (0U)
#define CAM_HISTOGRAM_FIFO_HIST_Y_GET(x) (((uint32_t)(x) & CAM_HISTOGRAM_FIFO_HIST_Y_MASK) >> CAM_HISTOGRAM_FIFO_HIST_Y_SHIFT)

/* Bitfield definition for register: ROI_WIDTH */
/*
 * ROI_WIDTH_END (RW)
 *
 * end address of width for roi
 */
#define CAM_ROI_WIDTH_ROI_WIDTH_END_MASK (0xFFFF0000UL)
#define CAM_ROI_WIDTH_ROI_WIDTH_END_SHIFT (16U)
#define CAM_ROI_WIDTH_ROI_WIDTH_END_SET(x) (((uint32_t)(x) << CAM_ROI_WIDTH_ROI_WIDTH_END_SHIFT) & CAM_ROI_WIDTH_ROI_WIDTH_END_MASK)
#define CAM_ROI_WIDTH_ROI_WIDTH_END_GET(x) (((uint32_t)(x) & CAM_ROI_WIDTH_ROI_WIDTH_END_MASK) >> CAM_ROI_WIDTH_ROI_WIDTH_END_SHIFT)

/*
 * ROI_WIDTH_START (RW)
 *
 * start address of width for roi
 */
#define CAM_ROI_WIDTH_ROI_WIDTH_START_MASK (0xFFFFU)
#define CAM_ROI_WIDTH_ROI_WIDTH_START_SHIFT (0U)
#define CAM_ROI_WIDTH_ROI_WIDTH_START_SET(x) (((uint32_t)(x) << CAM_ROI_WIDTH_ROI_WIDTH_START_SHIFT) & CAM_ROI_WIDTH_ROI_WIDTH_START_MASK)
#define CAM_ROI_WIDTH_ROI_WIDTH_START_GET(x) (((uint32_t)(x) & CAM_ROI_WIDTH_ROI_WIDTH_START_MASK) >> CAM_ROI_WIDTH_ROI_WIDTH_START_SHIFT)

/* Bitfield definition for register: ROI_HEIGHT */
/*
 * ROI_HEIGHT_END (RW)
 *
 * end address of height for roi
 */
#define CAM_ROI_HEIGHT_ROI_HEIGHT_END_MASK (0xFFFF0000UL)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_END_SHIFT (16U)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_END_SET(x) (((uint32_t)(x) << CAM_ROI_HEIGHT_ROI_HEIGHT_END_SHIFT) & CAM_ROI_HEIGHT_ROI_HEIGHT_END_MASK)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_END_GET(x) (((uint32_t)(x) & CAM_ROI_HEIGHT_ROI_HEIGHT_END_MASK) >> CAM_ROI_HEIGHT_ROI_HEIGHT_END_SHIFT)

/*
 * ROI_HEIGHT_START (RW)
 *
 * start address of height for roi
 */
#define CAM_ROI_HEIGHT_ROI_HEIGHT_START_MASK (0xFFFFU)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_START_SHIFT (0U)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_START_SET(x) (((uint32_t)(x) << CAM_ROI_HEIGHT_ROI_HEIGHT_START_SHIFT) & CAM_ROI_HEIGHT_ROI_HEIGHT_START_MASK)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_START_GET(x) (((uint32_t)(x) & CAM_ROI_HEIGHT_ROI_HEIGHT_START_MASK) >> CAM_ROI_HEIGHT_ROI_HEIGHT_START_SHIFT)

/* Bitfield definition for register: PRO_CTRL */
/*
 * ERR_INJECT (RW)
 *
 * 0 generate alarm in normal mode
 * 1 force to generate fatal alarm
 */
#define CAM_PRO_CTRL_ERR_INJECT_MASK (0x4000U)
#define CAM_PRO_CTRL_ERR_INJECT_SHIFT (14U)
#define CAM_PRO_CTRL_ERR_INJECT_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_ERR_INJECT_SHIFT) & CAM_PRO_CTRL_ERR_INJECT_MASK)
#define CAM_PRO_CTRL_ERR_INJECT_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_ERR_INJECT_MASK) >> CAM_PRO_CTRL_ERR_INJECT_SHIFT)

/*
 * ROI_UPDATE (RW)
 *
 * roi configration update
 */
#define CAM_PRO_CTRL_ROI_UPDATE_MASK (0x80U)
#define CAM_PRO_CTRL_ROI_UPDATE_SHIFT (7U)
#define CAM_PRO_CTRL_ROI_UPDATE_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_ROI_UPDATE_SHIFT) & CAM_PRO_CTRL_ROI_UPDATE_MASK)
#define CAM_PRO_CTRL_ROI_UPDATE_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_ROI_UPDATE_MASK) >> CAM_PRO_CTRL_ROI_UPDATE_SHIFT)

/*
 * SCALE_UPDATE (RW)
 *
 * scale configration update
 */
#define CAM_PRO_CTRL_SCALE_UPDATE_MASK (0x40U)
#define CAM_PRO_CTRL_SCALE_UPDATE_SHIFT (6U)
#define CAM_PRO_CTRL_SCALE_UPDATE_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_SCALE_UPDATE_SHIFT) & CAM_PRO_CTRL_SCALE_UPDATE_MASK)
#define CAM_PRO_CTRL_SCALE_UPDATE_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_SCALE_UPDATE_MASK) >> CAM_PRO_CTRL_SCALE_UPDATE_SHIFT)

/*
 * SCALE_HEIGHT_SELECT (RW)
 *
 * 000 keep all pixel for height
 * 001 keep 1 for every 2 pixel for height
 * 010 keep 1 for every 3 pixel for height
 * 011 keep 1 for every 4 pixel for height
 * 100 keep 1 for every 5 pixel for height
 * 101 keep 1 for every 6 pixel for height
 * 110 keep 1 for every 7 pixel for height
 * 111 keep 1 for every 8 pixel for height
 */
#define CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_MASK (0x38U)
#define CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_SHIFT (3U)
#define CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_SHIFT) & CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_MASK)
#define CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_MASK) >> CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_SHIFT)

/*
 * SCALE_WIDTH_SELECT (RW)
 *
 * 000 keep all pixel for width
 * 001 keep 1 for every 2 pixel for width
 * 010 keep 1 for every 3 pixel for width
 * 011 keep 1 for every 4 pixel for width
 * 100 keep 1 for every 5 pixel for width
 * 101 keep 1 for every 6 pixel for width
 * 110 keep 1 for every 7 pixel for width
 * 111 keep 1 for every 8 pixel for width
 */
#define CAM_PRO_CTRL_SCALE_WIDTH_SELECT_MASK (0x7U)
#define CAM_PRO_CTRL_SCALE_WIDTH_SELECT_SHIFT (0U)
#define CAM_PRO_CTRL_SCALE_WIDTH_SELECT_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_SCALE_WIDTH_SELECT_SHIFT) & CAM_PRO_CTRL_SCALE_WIDTH_SELECT_MASK)
#define CAM_PRO_CTRL_SCALE_WIDTH_SELECT_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_SCALE_WIDTH_SELECT_MASK) >> CAM_PRO_CTRL_SCALE_WIDTH_SELECT_SHIFT)

/* Bitfield definition for register: ACT_SIZE */
/*
 * ACT_HEIGHT (RW)
 *
 * actual height after scale and/or roi
 */
#define CAM_ACT_SIZE_ACT_HEIGHT_MASK (0xFFFF0000UL)
#define CAM_ACT_SIZE_ACT_HEIGHT_SHIFT (16U)
#define CAM_ACT_SIZE_ACT_HEIGHT_SET(x) (((uint32_t)(x) << CAM_ACT_SIZE_ACT_HEIGHT_SHIFT) & CAM_ACT_SIZE_ACT_HEIGHT_MASK)
#define CAM_ACT_SIZE_ACT_HEIGHT_GET(x) (((uint32_t)(x) & CAM_ACT_SIZE_ACT_HEIGHT_MASK) >> CAM_ACT_SIZE_ACT_HEIGHT_SHIFT)

